mis and task allocation
